app/controllers/todos_controller.rb

  def index
    @todos = Todo.all.map {|todo| todo}
---
SELECT `todos`.* FROM `todos`

  def create
    new_todo = Todo.new(passing)
    if new_todo.save
---
INSERT INTO `todos` (`new_task`, `date`, `created_at`, `updated_at`) VALUES ('hasan', '2022-06-21', '2022-06-27 06:31:22.116892', '2022-06-27 06:31:22.116892')

def delete
  @delete_task = Todo.find(params[:id])
  @delete_task.destroy
---
SELECT `todos`.* FROM `todos` WHERE `todos`.`id` = 20 LIMIT 1
DELETE FROM `todos` WHERE `todos`.`id` = 20

def update
  id = params[:id]
  todo = Todo.find(id)
  todo.status = params[:status]
  todo.save
---
SELECT `todos`.* FROM `todos` WHERE `todos`.`id` = 1 LIMIT 1
UPDATE `todos` SET `todos`.`updated_at` = '2022-06-29 08:39:15.425629', `todos`.`status` = NULL WHERE `todos`.`id` = 1